有趣的代码注释

一、	codeDesign老鼠
.--,       .--,
 ( (  \.---./  ) )
  '.__/o   o\__.'
     {=  ^  =}
      >  -  <
     /       \
    //       \\
   //|   .   |\\
   "'\       /'"_.-~^`'-.
      \  _  /--'         `
    ___)( )(___
   (((__) (__)))    高山仰止,景行行止.虽不能至,心向往之。

二、codeDesign佛祖保佑 永无BUG

 1 /**
 2  *                             _ooOoo_
 3  *                            o8888888o
 4  *                            88" . "88
 5  *                            (| -_- |)
 6  *                            O\  =  /O
 7  *                         ____/`---'\____
 8  *                       .'  \\|     |//  `.
 9  *                      /  \\|||  :  |||//  \
10  *                     /  _||||| -:- |||||-  \
11  *                     |   | \\\  -  /// |   |
12  *                     | \_|  ''\---/''  |   |
13  *                     \  .-\__  `-`  ___/-. /
14  *                   ___`. .'  /--.--\  `. . __
15  *                ."" '<  `.___\_<|>_/___.'  >'"".
16  *               | | :  `- \`.;`\ _ /`;.`/ - ` : | |
17  *               \  \ `-.   \_ __\ /__ _/   .-` /  /
18  *          ======`-.____`-.___\_____/___.-`____.-'======
19  *                             `=---='
20  *          ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
21  *                     佛祖保佑        永无BUG
22  *            佛曰:
23  *                   写字楼里写字间，写字间里程序员；
24  *                   程序人员写程序，又拿程序换酒钱。
25  *                   酒醒只在网上坐，酒醉还来网下眠；
26  *                   酒醉酒醒日复日，网上网下年复年。
27  *                   但愿老死电脑间，不愿鞠躬老板前；
28  *                   奔驰宝马贵者趣，公交自行程序员。
29  *                   别人笑我忒疯癫，我笑自己命太贱；
30  *                   不见满街漂亮妹，哪个归得程序员？
31 */

 
三、	codeDesign神兽保佑 永无BUG

 1 // ┏┓　　　┏┓
 2 // ┏┛┻━━━┛┻┓
 3 // ┃　　　　　　　┃
 4 // ┃　　　━　　　┃
 5 // ┃　┳┛　┗┳　┃
 6 // ┃　　　　　　　┃
 7 // ┃　　　┻　　　┃
 8 // ┃　　　　　　　┃
 9 // ┗━┓　　　┏━┛
10 // ┃　　　┃ 神兽保佑
11 // ┃　　　┃ 代码无BUG！
12 // ┃　　　┗━━━┓
13 // ┃　　　　　　　┣┓
14 // ┃　　　　　　　┏┛
15 // ┗┓┓┏━┳┓┏┛
16 // ┃┫┫　┃┫┫
17 // ┗┻┛　┗┻┛

 
四、	codeDesign美女保佑 永无BUG

 1 //
 2 //                       .::::.
 3 //                     .::::::::.
 4 //                    :::::::::::
 5 //                 ..:::::::::::'
 6 //              '::::::::::::'
 7 //                .::::::::::
 8 //           '::::::::::::::..
 9 //                ..::::::::::::.
10 //              ``::::::::::::::::
11 //               ::::``:::::::::'        .:::.
12 //              ::::'   ':::::'       .::::::::.
13 //            .::::'      ::::     .:::::::'::::.
14 //           .:::'       :::::  .:::::::::' ':::::.
15 //          .::'        :::::.:::::::::'      ':::::.
16 //         .::'         ::::::::::::::'         ``::::.
17 //     ...:::           ::::::::::::'              ``::.
18 //    ```` ':.          ':::::::::'                  ::::..
19 //                       '.:::::'                    ':'````..
20 //

 
五、	codeDesign书本

1 //                .-~~~~~~~~~-._       _.-~~~~~~~~~-.
2 //            __.'              ~.   .~              `.__
3 //          .'//                  \./                  \\`.
4 //        .'//                     |                     \\`.
5 //      .'// .-~"""""""~~~~-._     |     _,-~~~~"""""""~-. \\`.
6 //    .'//.-"                 `-.  |  .-'                 "-.\\`.
7 //  .'//______.============-..   \ | /   ..-============.______\\`.
8 //.'______________________________\|/______________________________`.

 
 
六、	codeDesign比克大魔王

 1 /*
 2                _.---..._
 3            ./^         ^-._
 4          ./^C===.         ^\.   /\
 5         .|'     \\        _ ^|.^.|
 6    ___.--'_     ( )  .      ./ /||
 7   /.---^T\      ,     |     / /|||
 8  C'   ._`|  ._ /  __,-/    / /-,||
 9       \ \/    ;  /O  / _    |) )|,
10        i \./^O\./_,-^/^    ,;-^,'
11         \ |`--/ ..-^^      |_-^
12          `|  \^-           /|:
13           i.  .--         / '|.
14            i   =='       /'  |\._
15          _./`._        //    |.  ^-ooo.._
16   _.oo../'  |  ^-.__./X/   . `|    |#######b
17  d####     |'      ^^^^   /   |    _\#######
18  #####b ^^^^^^^^--. ...--^--^^^^^^^_.d######
19  ######b._         Y            _.d#########
20  ##########b._     |        _.d#############
21 
22  */
 


 1 /*
 2                               /^_.-^  _  --^=_
 3                            ./'-^__    _>=\^^==^-.
 4                            |'/^^_/  /^    \ \.^\\\/\
 5                           ,|/| '  /'  _____\ `\|.^.|
 6                           |'/   /_--^^ .   ^^-./ /||
 7                           |/,--^  ,     |     / /||'
 8                         ._|/   \ /  __,-/    / /-,||
 9                         \ '/    ;  /O  / _    |) )|,
10                          i \./^O\./_,-^/^    ,;-^,'
11                           \ |`--/ ..-^^      |_-^
12                            `|  \^-_,/^Y\      | ^^\
13                            _i.  \".--V_/     /| \. ^\._____...--.>^^^^^^-------...._
14                           /  i   ^--^^     /'|' |\. |./'        |                  ;
15         ___...----/^^^^---|.  `._\  /^   /' |'_/' \ `|         |'               ,/'
16                  |'        \   _|^-.__./'__.^^\     .|        ,|            _.-^
17                  `\       ,|`_./^^-----^^._    ` ./ /        /^        _.-^^/
18                           |'  ^                  /-^                ./^    /
19         \                 `\_     __.-<       _,/                 ./'     |'
20          `\.        `i       ^^--/._____...--^            .      ./       |.
21            `|        |                                   /       /        `|
22 
23         */

 
七、	codeDesign悟空

  1 /*
  2                                 MMMMM
  3                                   MMMMMM
  4                                     MMMMMMM
  5                                      MMMMMMMM     .
  6                                       MMMMMMMMM
  7                                       HMMMMMMMMMM
  8                                        MMMMMMMMMMMM  M
  9                                        MMMMMMMMMMMMM  M
 10                                         MMMMMMMMMMMMM  M
 11                                         MMMMMMMMMMMMM:
 12                                         oMMMMMMMMMMMMMM
 13               .MMMMMMMMMMMMMMo           MMMMMMMMMMMMMMM M
 14         MMMMMMMMMMMMMMMMMMMMMMMMMMM      MMMMMMMMMMMMMMMM
 15           MMMMMMMMMMMMMMMMMMMMMMMMMMMM.  oMMMMMMMMMMMMMMM.M
 16             MMMMMMMMMMMMMMMMMMMMMMMMMMMM  MMMMMMMMMMMMMMMM
 17               MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM
 18                 oMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM
 19                   MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM
 20                     MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM:                     H
 21                      MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM                  .         MMM
 22                       MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM              M       MMMMMM
 23                        .MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM          M   MMMMMMMMMM
 24                 MM.      MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM       M MMMMMMMMMMMM
 25                     MM    MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM    .MMMMMMMMMMMMMM
 26                       MM  MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM
 27                         MM MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM
 28                .MMMMMMMMM MMMMMMMMMMMMMMMMMMMMMMMM.MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM
 29                   HMMMMMMMMMMMMMMMMMMMMM.MMMMMMMMM.MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM
 30                      MMMMMMMMMMMMMMM MMM.oMMMMMMM..MMMMMMMMM:MMMMMMMMMMMMMMMMMMMMMMM
 31                        MMMMMMMMMMMMMM MM..MMMMMMM...MMMMMMM. MMMMMMMMMMMMMMMMMMMMM
 32                          MMMMMMMMMMMMMMM ..MMMMMM...MMMMMM ..MMMMMMMMMMMMMMMMMMM
 33                           MMMMMMM:M.MMM.M.. MMMMM M..MMMMM...MMMMMMMMMMMMMMMMMM  MMM
 34                             MMMM. .M..MM.M...MMMMMM..MMMMM.. MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM .
 35                              MMMM..M....M.....:MMM .MMMMMM..MMMMMMM...MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM
 36                               MMM.M.. ...M......MM.MMMMM.......MHM.M  .MMMMMMMMMMMMMMMMMMMMMMMMM
 37                          MMMMMMMM..MM. . MMM.....MMMMMM.M.....M ..MM..M MMMMMMMMMMMMMMMMMMM
 38                             .MMMMMHMM. ..MMMM. MMM............o..... . .MMMMMMMMMMMMMMM
 39                                MMM. M... .........................M..:.MMMMMMMMMMMM
 40                                  oMMM............ .................M.M.MMMMMMMMM
 41                                     .....MM........................ . MMMMMM
 42                                    M.....M.....................o.MM.MMMMMMMM.
 43                                     M........................M.. ...MMMMMMMMMMMMMo
 44                                       :....MMM..............MMM..oMMMMMMM
 45                                        M...MMM.............MMMMMMM
 46                                           .............:MMMMMMMM
 47                                           M..... MMM.....M
 48                                           M M.............
 49                                           ................M
 50                                        ooM.................MM  MoMMMMMoooM
 51                                   MMoooM......................MoooooooH..oMM
 52                               MHooooMoM.....................MMooooooM........M
 53                             oooooooMoooM......... o........MoooooooM............
 54                             Mooooooooooo.......M.........Moooooooo:..............M
 55                            MooMoooooooooM...M........:Mooooooooooo:..............M
 56                           M..oooooooooooo .........Mooooooooooooooo..............M
 57                          M...Mooo:oooooooo.M....ooooooooooooooooooo..M...........M
 58                           ...oooooMoooooooM..Mooooooooooooo:oooooooM.M...........M.
 59                          M...ooooooMoo:ooooMoooooooooooooHoooooooooH:M. ...........:
 60                          M..MoooooooMoooooooooooooooooo:ooooooMooooMoM..............M
 61                          M..ooooooooooMooooooooooooooHoooooooMooHooooM...............M
 62                          ...ooooooooooooooooooo:MooooooooooooooMoMoooM................
 63                         M...oooooooooooooooooooooooooooooooooooooMooMM................M
 64                         ...MooooooooooooooooooooooooooooooooooooooooMo ................
 65                         ...MooooooooooooooooooooooooooooooooooooooooM M................M
 66                        M...ooooooooooooooooooooooooooooooooooooooooM   ................M
 67                        ...MoooooooooooooooooooooooooooooooooooooooMM   .:...............
 68                        .....MooooooooooooooooooooooooooooooooooooMoo       .............M
 69                        M...... ooooooooooooooooooooooooooooooooooooM       M..............M
 70                        M........MooooMMM MM MM  MMMMMMMMMooooooooM         M...............M
 71                        .........HM     M:  MM :MMMMMM          M           M...............
 72                       M..........M     M   MoM M                           M................M
 73                       M.........:M  MoH  M M M MooooHoooMM.   M             M...............M
 74                       M..........Moooo MMooM    oooooMooooooooM              M..............H
 75                       M.........MooooM  Mooo  : ooooooMooooMoooM              M........ . .o.M
 76                       H..  .....ooooo   oooo  M MooooooooooooooM               M... MMMMMMMMMMM
 77                       MMMMMMMMMMooooM M oooo  .  ooooooMooooooooM              .MMMMMMMMMMMMMMM
 78                       MMMMMMMMMMooooH : ooooH    oooooooooooooooo               MMMMMMMMMMMMMMM
 79                       MMMMMMMMMMoooo    ooooM    Moooooooooooooooo              .MMMMMMMMMMMMMMM
 80                       MMMMMMMMMMoooo    ooooM    MooooooooooooooooM              MMMMMMMMMMMMMMM
 81                       MMMMMMMMMMoooM    ooooM     ooooooooooooooooo               MMMMMMMMMMM:M
 82                       MMMMMMMMMMoooM   MooooM     oooooooooooMoooooo               MH...........
 83                        . ......Mooo.   MooooM     oooooooooooooooooo              M............M
 84                       M.M......oooo    MooooM     Moooooooooooooooooo:           .........M.....
 85                       M.M.....Moooo    MooooM      ooooooooooooooooooM            .M............
 86                       .......MooooH    MooooM      oooooooooMoooooooooo          M..o...M..o....M
 87                       .o....HMooooM    MooooH      MooooooooMooooooooooM          .:M...M.......M
 88                      M..M.....MoooM    :oooo:    .MooooooooHooMoooooooooM         M M... ..oM.M
 89                       M...M.:.Mooo. MMMMooooo   oooooooooooMoooooooooooooM          ....M. M
 90                        M:M..o.Moooooooooooooo MooooooooooooooMooooooooooooM          .Mo
 91                               MooooooooooooooMooooooooooooMoMoooooooooooooo
 92                               Mooooooooooooooo:ooooooooooooooooooooooooooooo
 93                               ooooooooooooooooMooooooooooMoooooooooooooooooo
 94                               ooooooooooooooooMoooooooooooMooooooooooooooooHo
 95                               ooMooooooooooooooMoooooooooooooooooooooooooooMoM
 96                              MooMoooooooooooooo.ooooooooooooooooooooooooooo:oM
 97                              MoooooooooooooooooooooooooooooooooooooooooooooooM
 98                              MoooMooooooooooooooMooooooooooooooooooooooooooooo.
 99                              MoooMooooooooooooooMoooooooooooooooooooooooooMooooM
100                              MooooooooooooooooooMoooooooooooooooooooooooooMoooooM
101                              MooooMoooooooooooooMoooooooooooooooooooooooooMoHooooM
102                              ooooooMooooooooooooooooooooooooooooooooooooooooMoMoooM
103                             MooooooooooooooooooooMooooooooooooooooooooooooooMoooooH:
104                             MoooooooMooooooooooooMoooooooooooooooooooooooooooooHoooM
105                             MooooooooMoooooooooooMoooooooooooooooooooooooooMoooMooooM
106                             Moooooooooooooooooooooooooooooooooooooooooooooo.oooMooooo
107                             MoooooooooooooooooooooooooooooooooooooooooooooMoooooooooM
108                              MooooooooooooooooooooMoooooooooooooooooooooooooooooooooM
109                               MooooooooooooooooooooMHooooooooooooooooooooMoooo:ooooo
110                                MMooooooooooooooooooMoMHoooooooooooooooooooooooMooooo
111                                 MMoooooooooooooooMMooo MMooooooooooooooooooooooooooM
112                                 MMMoooooooooooooMooooo  oooooooooooooooooooooMooooo
113                                 MooMMoooooooooMoooMMoM  ooooHooooooooooooooooMooooM
114                                 MooooMooooooMooooMoooM  MoooooMoooooooooooooMooooo
115                                 ooooooMMooooooooMooooM  MoooooooooMooooooooooooooM
116                                 HooooooMoooooooMooooM    HoooooooHooMooooooooooooo
117                                  oooMoooooooooHoooM         MoooooooooMoooooooooM
118                                   HooooooooooooHM             MooooooooMMoooooooM
119                                    MMMMMMMMMMMMMM                Moooooo:MooooHMM
120                                     MMMMMMM: ...                  MMMMMMMMMMMMMM
121                                    M............M                  MMMMMMMMM ....
122                                    M.MM..........                  M.............M
123                                 M ..............MM                 M..............
124                              MMMMM............MMMM                 ..MMMMMMMM ....M
125                            MMMMMMMMMMMMMMMMMMMMMMMM               MMMMMMMMMMMMM...M
126                         .MMMMMMMMMMMMMMMMMMMMMMMMMM               MMMMMMMMMMMMMMMMMM
127                         MMMMMMMMMMMMMMMMMMMMMMMMM                MMMMMMMMMMMMMMMMMMM
128                         :MMMMMMMMMMMMMMMMMMH                     MMMMMMMMMMMMMMMMMMM
129                            By EBEN Jérôme                        MMMMMMMMMMMMMMMMMM
130                                                                  MMMMMMMMMMMMMMM
131                                                                   HMMMMMM
132 
133         */



/*
                           _
                           \"-._ _.--"~~"--._
                            \   "            ^.    ___
                            /                  \.-~_.-~
                     .-----'     /\/"\ /~-._      /
                    /  __      _/\-.__\L_.-/\     "-.
                   /.-"  \    ( ` \_o>"<o_/  \  .--._\
                  /'      \    \:     "     :/_/     "`
                          /  /\ "\    ~    /~"
                          \ I  \/]"-._ _.-"[
                       ___ \|___/ ./    l   \___   ___
                  .--v~   "v` ( `-.__   __.-' ) ~v"   ~v--.
               .-{   |     :   \_    "~"    _/   :     |   }-.
              /   \  |           ~-.,___,.-~           |  /   \
             ]     \ |                                 | /     [
             /\     \|     :                     :     |/     /\
            /  ^._  _K.___,^                     ^.___,K_  _.^  \
           /   /  "~/  "\                           /"  \~"  \   \
          /   /    /     \ _          :          _ /     \    \   \
        .^--./    /       Y___________l___________Y       \    \.--^.
        [    \   /        |        [/    ]        |        \   /    ]
        |     "v"         l________[____/]________j  -Row   }r"     /
        }------t          /                       \       /`-.     /
        |      |         Y                         Y     /    "-._/
        }-----v'         |         :               |     7-.     /
        |   |_|          |         l               |    / . "-._/
        l  .[_]          :          \              :  r[]/_.  /
         \_____]                     "--.             "-.____/
          
 */





 
八、	codeDesign皮卡丘

 1 /*
 2         quu..__
 3          $$$b  `---.__
 4           "$$b        `--.                          ___.---uuudP
 5            `$$b           `.__.------.__     __.---'      $$$$"              .
 6              "$b          -'            `-.-'            $$$"              .'|
 7                ".                                       d$"             _.'  |
 8                  `.   /                              ..."             .'     |
 9                    `./                           ..::-'            _.'       |
10                     /                         .:::-'            .-'         .'
11                    :                          ::''\          _.'            |
12                   .' .-.             .-.           `.      .'               |
13                   : /'$$|           .@"$\           `.   .'              _.-'
14                  .'|$u$$|          |$$,$$|           |  <            _.-'
15                  | `:$$:'          :$$$$$:           `.  `.       .-'
16                  :                  `"--'             |    `-.     \
17                 :##.       ==             .###.       `.      `.    `\
18                 |##:                      :###:        |        >     >
19                 |#'     `..'`..'          `###'        x:      /     /
20                  \                                   xXX|     /    ./
21                   \                                xXXX'|    /   ./
22                   /`-.                                  `.  /   /
23                  :    `-  ...........,                   | /  .'
24                  |         ``:::::::'       .            |<    `.
25                  |             ```          |           x| \ `.:``.
26                  |                         .'    /'   xXX|  `:`M`M':.
27                  |    |                    ;    /:' xXXX'|  -'MMMMM:'
28                  `.  .'                   :    /:'       |-'MMMM.-'
29                   |  |                   .'   /'        .'MMM.-'
30                   `'`'                   :  ,'          |MMM<
31                     |                     `'            |tbap\
32                      \                                  :MM.-'
33                       \                 |              .''
34                        \.               `.            /
35                         /     .:::::::.. :           /
36                        |     .:::::::::::`.         /
37                        |   .:::------------\       /
38                       /   .''               >::'  /
39                       `',:                 :    .'
40                                            `:.:'
41 
42 
43         */

 
九、	codeDesign电脑

 1 /*
 2                      ,----------------,              ,---------,
 3                 ,-----------------------,          ,"        ,"|
 4               ,"                      ,"|        ,"        ,"  |
 5              +-----------------------+  |      ,"        ,"    |
 6              |  .-----------------.  |  |     +---------+      |
 7              |  |                 |  |  |     | -==----'|      |
 8              |  |  I LOVE DOS!    |  |  |     |         |      |
 9              |  |  Bad command or |  |  |/----|`---=    |      |
10              |  |  C:\>_          |  |  |   ,/|==== ooo |      ;
11              |  |                 |  |  |  // |(((( [33]|    ,"
12              |  `-----------------'  |," .;'| |((((     |  ,"
13              +-----------------------+  ;;  | |         |,"
14                 /_)______________(_/  //'   | +---------+
15            ___________________________/___  `,
16           /  oooooooooooooooo  .o.  oooo /,   \,"-----------
17          / ==ooooooooooooooo==.o.  ooo= //   ,`\--{)B     ,"
18         /_==__==========__==_ooo__ooo=_/'   /___________,"
19 
20         */

 
十、	codeDesign龙

/*
 * ......................................&&.........................
 * ....................................&&&..........................
 * .................................&&&&............................
 * ...............................&&&&..............................
 * .............................&&&&&&..............................
 * ...........................&&&&&&....&&&..&&&&&&&&&&&&&&&........
 * ..................&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&..............
 * ................&...&&&&&&&&&&&&&&&&&&&&&&&&&&&&.................
 * .......................&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&.........
 * ...................&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&...............
 * ..................&&&   &&&&&&&&&&&&&&&&&&&&&&&&&&&&&............
 * ...............&&&&&@  &&&&&&&&&&..&&&&&&&&&&&&&&&&&&&...........
 * ..............&&&&&&&&&&&&&&&.&&....&&&&&&&&&&&&&..&&&&&.........
 * ..........&&&&&&&&&&&&&&&&&&...&.....&&&&&&&&&&&&&...&&&&........
 * ........&&&&&&&&&&&&&&&&&&&.........&&&&&&&&&&&&&&&....&&&.......
 * .......&&&&&&&&.....................&&&&&&&&&&&&&&&&.....&&......
 * ........&&&&&.....................&&&&&&&&&&&&&&&&&&.............
 * ..........&...................&&&&&&&&&&&&&&&&&&&&&&&............
 * ................&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&............
 * ..................&&&&&&&&&&&&&&&&&&&&&&&&&&&&..&&&&&............
 * ..............&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&....&&&&&............
 * ...........&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&......&&&&............
 * .........&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&.........&&&&............
 * .......&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&...........&&&&............
 * ......&&&&&&&&&&&&&&&&&&&...&&&&&&...............&&&.............
 * .....&&&&&&&&&&&&&&&&............................&&..............
 * ....&&&&&&&&&&&&&&&.................&&...........................
 * ...&&&&&&&&&&&&&&&.....................&&&&......................
 * ...&&&&&&&&&&.&&&........................&&&&&...................
 * ..&&&&&&&&&&&..&&..........................&&&&&&&...............
 * ..&&&&&&&&&&&&...&............&&&.....&&&&...&&&&&&&.............
 * ..&&&&&&&&&&&&&.................&&&.....&&&&&&&&&&&&&&...........
 * ..&&&&&&&&&&&&&&&&..............&&&&&&&&&&&&&&&&&&&&&&&&.........
 * ..&&.&&&&&&&&&&&&&&&&&.........&&&&&&&&&&&&&&&&&&&&&&&&&&&.......
 * ...&&..&&&&&&&&&&&&.........&&&&&&&&&&&&&&&&...&&&&&&&&&&&&......
 * ....&..&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&...........&&&&&&&&.....
 * .......&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&..............&&&&&&&....
 * .......&&&&&.&&&&&&&&&&&&&&&&&&..&&&&&&&&...&..........&&&&&&....
 * ........&&&.....&&&&&&&&&&&&&.....&&&&&&&&&&...........&..&&&&...
 * .......&&&........&&&.&&&&&&&&&.....&&&&&.................&&&&...
 * .......&&&...............&&&&&&&.......&&&&&&&&............&&&...
 * ........&&...................&&&&&&.........................&&&..
 * .........&.....................&&&&........................&&....
 * ...............................&&&.......................&&......
 * ................................&&......................&&.......
 * .................................&&..............................
 * ..................................&..............................
 */
 


 1 /*
 2                                                      __----~~~~~~~~~~~------___
 3                                           .  .   ~~//====......          __--~ ~~
 4                           -.            \_|//     |||\\  ~~~~~~::::... /~
 5                        ___-==_       _-~o~  \/    |||  \\            _/~~-
 6                __---~~~.==~||\=_    -_--~/_-~|-   |\\   \\        _/~
 7            _-~~     .=~    |  \\-_    '-~7  /-   /  ||    \      /
 8          .~       .~       |   \\ -_    /  /-   /   ||      \   /
 9         /  ____  /         |     \\ ~-_/  /|- _/   .||       \ /
10         |~~    ~~|--~~~~--_ \     ~==-/   | \~--===~~        .\
11                  '         ~-|      /|    |-~\~~       __--~~
12                              |-~~-_/ |    |   ~\_   _-~            /\
13                                   /  \     \__   \/~                \__
14                               _--~ _/ | .-~~____--~-/                  ~~==.
15                              ((->/~   '.|||' -_|    ~~-/ ,              . _||
16                                         -_     ~\      ~~---l__i__i__i--~~_/
17                                         _-~-__   ~)  \--______________--~~
18                                       //.-~~~-~_--~- |-------~~~~~~~~
19                                              //.-~~~--\
20 
21 
22         */

 

 1 /*
 2                  ___====-_  _-====___
 3            _--^^^#####//      \\#####^^^--_
 4         _-^##########// (    ) \\##########^-_
 5        -############//  |\^^/|  \\############-
 6      _/############//   (@::@)   \\############\_
 7     /#############((     \\//     ))#############\
 8    -###############\\    (oo)    //###############-
 9   -#################\\  / VV \  //#################-
10  -###################\\/      \//###################-
11 _#/|##########/\######(   /\   )######/\##########|\#_
12 |/ |#/\#/\#/\/  \#/\##\  |  |  /##/\#/  \/\#/\#/\#| \|
13 `  |/  V  V  `   V  \#\| |  | |/#/  V   '  V  V  \|  '
14    `   `  `      `   / | |  | | \   '      '  '   '
15                     (  | |  | |  )
16                    __\ | |  | | /__
17                   (vvv(VVV)(VVV)vvv)
18 
19 */

 
十一、	codeDesign高山仰止,景行行止.虽不能至,心向往之

 1 .--,       .--,
 2  ( (  \.---./  ) )
 3   '.__/o   o\__.'
 4      {=  ^  =}
 5       >  -  <
 6      /       \
 7     //       \\
 8    //|   .   |\\
 9    "'\       /'"_.-~^`'-.
10       \  _  /--'         `
11     ___)( )(___
12    (((__) (__)))    高山仰止,景行行止.虽不能至,心向往之。

 
十二、	codeDesign骷髅

 1 1 /* 2  **************************************************************
 2  3  *                                                            *
 3  4  *   .=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-.       *
 4  5  *    |                     ______                     |      *
 5  6  *    |                  .-"      "-.                  |      *
 6  7  *    |                 /            \                 |      *
 7  8  *    |     _          |              |          _     |      *
 8  9  *    |    ( \         |,  .-.  .-.  ,|         / )    |      *
 9 10  *    |     > "=._     | )(__/  \__)( |     _.=" <     |      *
10 11  *    |    (_/"=._"=._ |/     /\     \| _.="_.="\_)    |      *
11 12  *    |           "=._"(_     ^^     _)"_.="           |      *
12 13  *    |               "=\__|IIIIII|__/="               |      *
13 14  *    |              _.="| \IIIIII/ |"=._              |      *
14 15  *    |    _     _.="_.="\          /"=._"=._     _    |      *
15 16  *    |   ( \_.="_.="     `--------`     "=._"=._/ )   |      *
16 17  *    |    > _.="                            "=._ <    |      *
17 18  *    |   (_/                                    \_)   |      *
18 19  *    |                                                |      *
19 20  *    '-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-='      *
20 21  *                                                            *
21 22  *                                                            *
22 23  **************************************************************
23 24  */

 
十三、	codeDesign顶

/**
 * 頂頂頂頂頂頂頂頂頂　頂頂頂頂頂頂頂頂頂
 * 頂頂頂頂頂頂頂　　　　　頂頂　　　　　
 * 　　　頂頂　　　頂頂頂頂頂頂頂頂頂頂頂
 * 　　　頂頂　　　頂頂頂頂頂頂頂頂頂頂頂
 * 　　　頂頂　　　頂頂　　　　　　　頂頂
 * 　　　頂頂　　　頂頂　　頂頂頂　　頂頂
 * 　　　頂頂　　　頂頂　　頂頂頂　　頂頂
 * 　　　頂頂　　　頂頂　　頂頂頂　　頂頂
 * 　　　頂頂　　　頂頂　　頂頂頂　　頂頂
 * 　　　頂頂　　　　　　　頂頂頂　
 * 　　　頂頂　　　　　　頂頂　頂頂　頂頂
 * 　頂頂頂頂　　　頂頂頂頂頂　頂頂頂頂頂
 * 　頂頂頂頂　　　頂頂頂頂　　　頂頂頂頂
 */

十四、	codeDesign键盘

 1 /*
 2  * ┌───┐   ┌───┬───┬───┬───┐ ┌───┬───┬───┬───┐ ┌───┬───┬───┬───┐ ┌───┬───┬───┐
 3  * │Esc│   │ F1│ F2│ F3│ F4│ │ F5│ F6│ F7│ F8│ │ F9│F10│F11│F12│ │P/S│S L│P/B│  ┌┐    ┌┐    ┌┐
 4  * └───┘   └───┴───┴───┴───┘ └───┴───┴───┴───┘ └───┴───┴───┴───┘ └───┴───┴───┘  └┘    └┘    └┘
 5  * ┌───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───────┐ ┌───┬───┬───┐ ┌───┬───┬───┬───┐
 6  * │~ `│! 1│@ 2│# 3│$ 4│% 5│^ 6│& 7│* 8│( 9│) 0│_ -│+ =│ BacSp │ │Ins│Hom│PUp│ │N L│ / │ * │ - │
 7  * ├───┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─────┤ ├───┼───┼───┤ ├───┼───┼───┼───┤
 8  * │ Tab │ Q │ W │ E │ R │ T │ Y │ U │ I │ O │ P │{ [│} ]│ | \ │ │Del│End│PDn│ │ 7 │ 8 │ 9 │   │
 9  * ├─────┴┬──┴┬──┴┬──┴┬──┴┬──┴┬──┴┬──┴┬──┴┬──┴┬──┴┬──┴┬──┴─────┤ └───┴───┴───┘ ├───┼───┼───┤ + │
10  * │ Caps │ A │ S │ D │ F │ G │ H │ J │ K │ L │: ;│" '│ Enter  │               │ 4 │ 5 │ 6 │   │
11  * ├──────┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴────────┤     ┌───┐     ├───┼───┼───┼───┤
12  * │ Shift  │ Z │ X │ C │ V │ B │ N │ M │< ,│> .│? /│  Shift   │     │ ↑ │     │ 1 │ 2 │ 3 │   │
13  * ├─────┬──┴─┬─┴──┬┴───┴───┴───┴───┴───┴──┬┴───┼───┴┬────┬────┤ ┌───┼───┼───┐ ├───┴───┼───┤ E││
14  * │ Ctrl│    │Alt │         Space         │ Alt│    │    │Ctrl│ │ ← │ ↓ │ → │ │   0   │ . │←─┘│
15  * └─────┴────┴────┴───────────────────────┴────┴────┴────┴────┘ └───┴───┴───┘ └───────┴───┴───┘
16  */


十五。codeDesign-耶稣
/*
 *                                |~~~~~~~|
 *                                |       |
 *                                |       |
 *                                |       |
 *                                |       |
 *                                |       |
 *     |~.\\\_\~~~~~~~~~~~~~~xx~~~         ~~~~~~~~~~~~~~~~~~~~~/_//;~|
 *     |  \  o \_         ,XXXXX),                         _..-~ o /  |
 *     |    ~~\  ~-.     XXXXX`)))),                 _.--~~   .-~~~   |
 *      ~~~~~~~`\   ~\~~~XXX' _/ ';))     |~~~~~~..-~     _.-~ ~~~~~~~
 *               `\   ~~--`_\~\, ;;;\)__.---.~~~      _.-~
 *                 ~-.       `:;;/;; \          _..-~~
 *                    ~-._      `''        /-~-~
 *                        `\              /  /
 *                          |         ,   | |
 *                           |  '        /  |
 *                            \/;          |
 *                             ;;          |
 *                             `;   .       |
 *                             |~~~-----.....|
 *                            | \             \
 *                           | /\~~--...__    |
 *                           (|  `\       __-\|
 *                           ||    \_   /~    |
 *                           |)     \~-'      |
 *                            |      | \      '
 *                            |      |  \    :
 *                             \     |  |    |
 *                              |    )  (    )
 *                               \  /;  /\  |
 *                               |    |/   |
 *                               |    |   |
 *                                \  .'  ||
 *                                |  |  | |
 *                                (  | |  |
 *                                |   \ \ |
 *                                || o `.)|
 *                                |`\\) |
 *                                |       |
 *                                |       |
 */
 
 十六.codeDesign狗
 /*
 *                        ::
 *                       :;J7, :,                        ::;7:
 *                       ,ivYi, ,                       ;LLLFS:
 *                       :iv7Yi                       :7ri;j5PL
 *                      ,:ivYLvr                    ,ivrrirrY2X,
 *                      :;r@Wwz.7r:                :ivu@kexianli.
 *                     :iL7::,:::iiirii:ii;::::,,irvF7rvvLujL7ur
 *                    ri::,:,::i:iiiiiii:i:irrv177JX7rYXqZEkvv17
 *                 ;i:, , ::::iirrririi:i:::iiir2XXvii;L8OGJr71i
 *               :,, ,,:   ,::ir@mingyi.irii:i:::j1jri7ZBOS7ivv,
 *                  ,::,    ::rv77iiiriii:iii:i::,rvLq@huhao.Li
 *              ,,      ,, ,:ir7ir::,:::i;ir:::i:i::rSGGYri712:
 *            :::  ,v7r:: ::rrv77:, ,, ,:i7rrii:::::, ir7ri7Lri
 *           ,     2OBBOi,iiir;r::        ,irriiii::,, ,iv7Luur:
 *         ,,     i78MBBi,:,:::,:,  :7FSL: ,iriii:::i::,,:rLqXv::
 *         :      iuMMP: :,:::,:ii;2GY7OBB0viiii:i:iii:i:::iJqL;::
 *        ,     ::::i   ,,,,, ::LuBBu BBBBBErii:i:i:i:i:i:i:r77ii
 *       ,       :       , ,,:::rruBZ1MBBqi, :,,,:::,::::::iiriri:
 *      ,               ,,,,::::i:  @arqiao.       ,:,, ,:::ii;i7:
 *     :,       rjujLYLi   ,,:::::,:::::::::,,   ,:i,:,,,,,::i:iii
 *     ::      BBBBBBBBB0,    ,,::: , ,:::::: ,      ,,,, ,,:::::::
 *     i,  ,  ,8BMMBBBBBBi     ,,:,,     ,,, , ,   , , , :,::ii::i::
 *     :      iZMOMOMBBM2::::::::::,,,,     ,,,,,,:,,,::::i:irr:i:::,
 *     i   ,,:;u0MBMOG1L:::i::::::  ,,,::,   ,,, ::::::i:i:iirii:i:i:
 *     :    ,iuUuuXUkFu7i:iii:i:::, :,:,: ::::::::i:i:::::iirr7iiri::
 *     :     :rk@Yizero.i:::::, ,:ii:::::::i:::::i::,::::iirrriiiri::,
 *      :      5BMBBBBBBSr:,::rv2kuii:::iii::,:i:,, , ,,:,:i@petermu.,
 *           , :r50EZ8MBBBBGOBBBZP7::::i::,:::::,: :,:,::i;rrririiii::
 *               :jujYY7LS0ujJL7r::,::i::,::::::::::::::iirirrrrrrr:ii:
 *            ,:  :@kevensun.:,:,,,::::i:i:::::,,::::::iir;ii;7v77;ii;i,
 *            ,,,     ,,:,::::::i:iiiii:i::::,, ::::iiiir@xingjief.r;7:i,
 *         , , ,,,:,,::::::::iiiiiiiiii:,:,:::::::::iiir;ri7vL77rrirri::
 *          :,, , ::::::::i:::i:::i:i::,,,,,:,::i:i:::iir;@Secbone.ii:::
 */
 
 十七 codeDesign甩葱少女
 /*
 * _______________#########_______________________ 
 * ______________############_____________________ 
 * ______________#############____________________ 
 * _____________##__###########___________________ 
 * ____________###__######_#####__________________ 
 * ____________###_#######___####_________________ 
 * ___________###__##########_####________________ 
 * __________####__###########_####_______________ 
 * ________#####___###########__#####_____________ 
 * _______######___###_########___#####___________ 
 * _______#####___###___########___######_________ 
 * ______######___###__###########___######_______ 
 * _____######___####_##############__######______ 
 * ____#######__#####################_#######_____ 
 * ____#######__##############################____ 
 * ___#######__######_#################_#######___ 
 * ___#######__######_######_#########___######___ 
 * ___#######____##__######___######_____######___ 
 * ___#######________######____#####_____#####____ 
 * ____######________#####_____#####_____####_____ 
 * _____#####________####______#####_____###______ 
 * ______#####______;###________###______#________ 
 * ________##_______####________####______________ 
 */
 
 十八.codeDesign全键盘
 /*
 *  ┌───┐   ┌───┬───┬───┬───┐ ┌───┬───┬───┬───┐ ┌───┬───┬───┬───┐ ┌───┬───┬───┐
 *  │Esc│   │ F1│ F2│ F3│ F4│ │ F5│ F6│ F7│ F8│ │ F9│F10│F11│F12│ │P/S│S L│P/B│  ┌┐    ┌┐    ┌┐
 *  └───┘   └───┴───┴───┴───┘ └───┴───┴───┴───┘ └───┴───┴───┴───┘ └───┴───┴───┘  └┘    └┘    └┘
 *  ┌───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───────┐ ┌───┬───┬───┐ ┌───┬───┬───┬───┐
 *  │~ `│! 1│@ 2│# 3│$ 4│% 5│^ 6│& 7│* 8│( 9│) 0│_ -│+ =│ BacSp │ │Ins│Hom│PUp│ │N L│ / │ * │ - │
 *  ├───┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─────┤ ├───┼───┼───┤ ├───┼───┼───┼───┤
 *  │ Tab │ Q │ W │ E │ R │ T │ Y │ U │ I │ O │ P │{ [│} ]│ | \ │ │Del│End│PDn│ │ 7 │ 8 │ 9 │   │
 *  ├─────┴┬──┴┬──┴┬──┴┬──┴┬──┴┬──┴┬──┴┬──┴┬──┴┬──┴┬──┴┬──┴─────┤ └───┴───┴───┘ ├───┼───┼───┤ + │
 *  │ Caps │ A │ S │ D │ F │ G │ H │ J │ K │ L │: ;│" '│ Enter  │               │ 4 │ 5 │ 6 │   │
 *  ├──────┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴────────┤     ┌───┐     ├───┼───┼───┼───┤
 *  │ Shift  │ Z │ X │ C │ V │ B │ N │ M │< ,│> .│? /│  Shift   │     │ ↑ │     │ 1 │ 2 │ 3 │   │
 *  ├─────┬──┴─┬─┴──┬┴───┴───┴───┴───┴───┴──┬┴───┼───┴┬────┬────┤ ┌───┼───┼───┐ ├───┴───┼───┤ E││
 *  │ Ctrl│    │Alt │         Space         │ Alt│    │    │Ctrl│ │ ← │ ↓ │ → │ │   0   │ . │←─┘│
 *  └─────┴────┴────┴───────────────────────┴────┴────┴────┴────┘ └───┴───┴───┘ └───────┴───┴───┘
 */
 
 十九.codeDesign女神保佑
 <!--
        ´´´´´´´´██´´´´´´´
        ´´´´´´´████´´´´´´
        ´´´´´████████´´´´
        ´´`´███▒▒▒▒███´´´´´
        ´´´███▒●▒▒●▒██´´´
        ´´´███▒▒▒▒▒▒██´´´´´
        ´´´███▒▒▒▒██´                      项目：vue-user-center
        ´´██████▒▒███´´´´´                 语言： ES6-babel
        ´██████▒▒▒▒███´´                   框架： vue+vue-router+vuex+iview+axios
        ██████▒▒▒▒▒▒███´´´´                构建工具： webpack
        ´´▓▓▓▓▓▓▓▓▓▓▓▓▓▒´´                 版本控制： git-github
        ´´▒▒▒▒▓▓▓▓▓▓▓▓▓▒´´´´´              css预处理: less
        ´.▒▒▒´´▓▓▓▓▓▓▓▓▒´´´´´              代码风格：eslint-standard
        ´.▒▒´´´´▓▓▓▓▓▓▓▒                   编辑器： phpstorm
        ..▒▒.´´´´▓▓▓▓▓▓▓▒                  数据库:  mysql
        ´▒▒▒▒▒▒▒▒▒▒▒▒                      服务器端脚本: php go
        ´´´´´´´´´███████´´´´´              author: codeRabbit
        ´´´´´´´´████████´´´´´´´
        ´´´´´´´█████████´´´´´´
        ´´´´´´██████████´´´´             大部分人都在关注你飞的高不高，却没人在乎你飞的累不累，这就是现实！
        ´´´´´´██████████´´´                     我从不相信梦想，我，只，相，信，自，己！
        ´´´´´´´█████████´´
        ´´´´´´´█████████´´´
        ´´´´´´´´████████´´´´´
        ________▒▒▒▒▒
        _________▒▒▒▒
        _________▒▒▒▒
        ________▒▒_▒▒
        _______▒▒__▒▒
        _____ ▒▒___▒▒
        _____▒▒___▒▒
        ____▒▒____▒▒
        ___▒▒_____▒▒
        ███____ ▒▒
        ████____███
        █ _███_ _█_███
——————————————————————————女神保佑，代码无bug——————————————————————
-->

<!-- 

                              _.._        ,------------.
                           ,'      `.    (I want you! )
                          /  __) __` \    `-,----------'
                         (  (`-`(-')  ) _.-'
                         /)  \  = /  (
                        /'    |--' .  \
                       (  ,---|  `-.)__`
                        )(  `-.,--'   _`-.
                       '/,'          (  Uu",
                        (_       ,    `/,-' )
                        `.__,  : `-'/  /`--'
                          |     `--'  |
                          `   `-._   /
                           \        (
                           /\ .      \.  
                          / |` \     ,-\
                         /  \| .)   /   \
                        ( ,'|\    ,'     :
                        | \,`.`--"/      }
                        `,'    \  |,'    /
                       / "-._   `-/      |
                       "-.   "-.,'|     ;
                      /        _/["---'""]
                     :        /  |"-     '
                     '           |      /
                                 `      |

-->



▄▄▄▄▄
            ▀▀▀██████▄▄▄       _______________
          ▄▄▄▄▄  █████████▄  /                 \
         ▀▀▀▀█████▌ ▀▐▄ ▀▐█ | Gotta go fast!   |
       ▀▀█████▄▄ ▀██████▄██ | _________________/
       ▀▄▄▄▄▄  ▀▀█▄▀█════█▀ |/
            ▀▀▀▄  ▀▀███ ▀       ▄▄
         ▄███▀▀██▄████████▄ ▄▀▀▀▀▀▀█▌   ______________________________ 
       ██▀▄▄▄██▀▄███▀ ▀▀████      ▄██  █                              \\ 
    ▄▀▀▀▄██▄▀▀▌████▒▒▒▒▒▒███     ▌▄▄▀▀▀▀█_____________________________ //
    ▌    ▐▀████▐███▒▒▒▒▒▐██▌
    ▀▄▄▄▄▀   ▀▀████▒▒▒▒▄██▀
              ▀▀█████████▀
            ▄▄██▀██████▀█
          ▄██▀     ▀▀▀  █
         ▄█             ▐▌
     ▄▄▄▄█▌              ▀█▄▄▄▄▀▀▄
    ▌     ▐                ▀▀▄▄▄▀
     ▀▀▄▄▀     ██   
 \  ▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀ ▀ 
 \- ▌          SanicCRUD-vue              ▀ ▀      
  - ▌                            (o)          ▀ 
 /- ▌            Go Go Go !               ▀ ▀           
 /  ▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀ ▀       
               ██


 
 
 
  二十.codeDesign无敌剪刀手
  
  #                      d*##$.
# zP"""""$e.           $"    $o
#4$       '$          $"      $
#'$        '$        J$       $F
# 'b        $k       $>       $
#  $k        $r     J$       d$
#  '$         $     $"       $~
#   '$        "$   '$E       $
#    $         $L   $"      $F ...
#     $.       4B   $      $$$*"""*b
#     '$        $.  $$     $$      $F
#      "$       R$  $F     $"      $
#       $k      ?$ u*     dF      .$
#       ^$.      $$"     z$      u$$$$e
#        #$b             $E.dW@e$"    ?$
#         #$           .o$$# d$$$$c    ?F
#          $      .d$$#" . zo$>   #$r .uF
#          $L .u$*"      $&$$$k   .$$d$$F
#           $$"            ""^"$$$P"$P9$
#          JP              .o$$$$u:$P $$
#          $          ..ue$"      ""  $"
#         d$          $F              $
#         $$     ....udE             4B
#          #$    """"` $r            @$
#           ^$L        '$            $F
#             RN        4N           $
#              *$b                  d$
#               $$k                 $F
#               $$b                $F
#                 $""               $F
#                 '$                $
#                  $L               $
#                  '$               $
#                   $               $
#



 
 如果觉得插件还不错，文档还蛮详细的，对你有所帮助的话，就点击右上角给我个Star ⭐️ 鼓励一下我吧~